# A. IMPORTATION DE LIBRARIS

In [10]:
# Importation de libraries

In [2]:
import numpy as np

# 1. Tableau

## 1.1 Tableau a 1 D

In [11]:
# Creation d'un tableau a 1D
tab_1D = np.array([2, 4, 6, 8, 10, 12, 14])

In [12]:
tab_1D

array([ 2,  4,  6,  8, 10, 12, 14])

In [13]:
print(tab_1D)

[ 2  4  6  8 10 12 14]

In [14]:
print(tab_1D.shape)

(7,)

In [15]:
type(tab_1D)

numpy.ndarray

In [16]:
print("Dimension du Tableau", tab_1D.shape)
print("Type du Tableau", type(tab_1D))
print("Voici le Tableau:", tab_1D)

Dimension du Tableau (7,)
Type du Tableau <class 'numpy.ndarray'>
Voici le Tableau: [ 2  4  6  8 10 12 14]

## 1.2 Tableau 2D

In [23]:
# Creation d'un tableau a 2D
tab_2D = np.array([
    [1, 3, 5, 7, 8],
    [11, 33, 55, 77, 88],
    [10, 30, 50, 70, 80]
])

In [24]:
print("Dimension du Tableau", tab_2D.shape)
print("Type du Tableau", type(tab_2D))
print(tab_2D)

Dimension du Tableau (3, 5)
Type du Tableau <class 'numpy.ndarray'>
[[ 1  3  5  7  8]
 [11 33 55 77 88]
 [10 30 50 70 80]]

## 1.3 Tableau 3D

In [32]:
# Creation d'un tableeau 3D
tab_3D = np.array([[
    [11, 9, 7, 5, 3, 1],
    [110, 90, 70, 50, 30, 10],
    [115, 95, 75, 55, 35, 15],
    [1100, 900, 700, 500, 300, 100],
]])

In [33]:
print("Dimension du Tableau", tab_3D.shape)
print("Type du Tableau", type(tab_3D))
print(tab_3D)

Dimension du Tableau (1, 4, 6)
Type du Tableau <class 'numpy.ndarray'>
[[[  11    9    7    5    3    1]
  [ 110   90   70   50   30   10]
  [ 115   95   75   55   35   15]
  [1100  900  700  500  300  100]]]

## 1.4 Tableau a 4D

In [38]:
# Creation d'un Tableau a 4D
tab_4D = np.array([[[
    [2, 4, 6, 8, 10],
    [25, 45, 65, 85, 105],
    [20, 40, 60, 80, 100],
]]])

In [39]:
print("Dimension du Tableau", tab_4D.shape)
print("Type du Tableau", type(tab_4D))
print(tab_4D)

Dimension du Tableau (1, 1, 3, 5)
Type du Tableau <class 'numpy.ndarray'>
[[[[  2   4   6   8  10]
   [ 25  45  65  85 105]
   [ 20  40  60  80 100]]]]

# B. OPERATIONS

In [3]:
# creation matrice
a = np.array([[2,4,6,8],
              [25,45,65,85],
             ])
b = np.array([[20,40,60,80],
              [250,450,600,850],
             ])

In [4]:
print(a.shape)
print(a)
print(b.shape)
print(b)

(2, 4)
[[ 2  4  6  8]
 [25 45 65 85]]
(2, 4)
[[ 20  40  60  80]
 [250 450 600 850]]

In [5]:
# Addition
add = a+b
print(add)

[[ 22  44  66  88]
 [275 495 665 935]]

In [6]:
# soustraction
print( a-b )

[[ -18  -36  -54  -72]
 [-225 -405 -535 -765]]

In [7]:
# multiplication
print ( a*b )

[[   40   160   360   640]
 [ 6250 20250 39000 72250]]

In [8]:
# division 
print( a/b )

[[0.1        0.1        0.1        0.1       ]
 [0.1        0.1        0.10833333 0.1       ]]

# C MANIPULATION

In [9]:
# creation d'un dictionnaire
info_Etudiants = {
    'Matricule' : '20221235554',
    'Nom' : 'KASONGO',
    'Prenom' : 'David',
    'Age' : 23,
    'GPA': 'A'}

In [10]:
info_Etudiants

{'Matricule': '20221235554',
 'Nom': 'KASONGO',
 'Prenom': 'David',
 'Age': 23,
 'GPA': 'A'}

In [11]:
print(info_Etudiants)
{'Matricule': '20221235554', 'Nom': 'KASONGO', 'Prenom':'David', 'Age': 23, 'GPA': 'A'}

{'Matricule': '20221235554', 'Nom': 'KASONGO', 'Prenom': 'David', 'Age': 23, 'GPA': 'A'}

{'Matricule': '20221235554',
 'Nom': 'KASONGO',
 'Prenom': 'David',
 'Age': 23,
 'GPA': 'A'}

In [12]:
INFO_etudiant_bac3 ={
    'matricule' : ['202205533', '255222001', '23122522511', '255533333', '255566666'],
    'Nom' : ['NKULU','KABOLE','MUKUNA','BINENE','TSHIENSE'],
    'Prenom' : ['Dieumerci', 'David', 'Ben', 'Felly', 'Chris'],
    'Age' : [22, 21, 24, 23, 20],
    'GPA' : ['A', 'B', 'C', 'D', 'E']
}

In [13]:
print( INFO_etudiant_bac3)

{'matricule': ['202205533', '255222001', '23122522511', '255533333', '255566666'], 'Nom': ['NKULU', 'KABOLE', 'MUKUNA', 'BINENE', 'TSHIENSE'], 'Prenom': ['Dieumerci', 'David', 'Ben', 'Felly', 'Chris'], 'Age': [22, 21, 24, 23, 20], 'GPA': ['A', 'B', 'C', 'D', 'E']}

In [14]:
import pandas as pd

In [15]:
donnees_etudiants = pd.DataFrame(INFO_etudiant_bac3)

In [16]:
donnees_etudiants

     matricule       Nom     Prenom  Age GPA
0    202205533     NKULU  Dieumerci   22   A
1    255222001    KABOLE      David   21   B
2  23122522511    MUKUNA        Ben   24   C
3    255533333    BINENE      Felly   23   D
4    255566666  TSHIENSE      Chris   20   E

In [17]:
donnees_etudiants.head(4)

     matricule     Nom     Prenom  Age GPA
0    202205533   NKULU  Dieumerci   22   A
1    255222001  KABOLE      David   21   B
2  23122522511  MUKUNA        Ben   24   C
3    255533333  BINENE      Felly   23   D

In [18]:
donnees_etudiants.tail(2)

   matricule       Nom Prenom  Age GPA
3  255533333    BINENE  Felly   23   D
4  255566666  TSHIENSE  Chris   20   E

In [19]:
print(donnees_etudiants)

     matricule       Nom     Prenom  Age GPA
0    202205533     NKULU  Dieumerci   22   A
1    255222001    KABOLE      David   21   B
2  23122522511    MUKUNA        Ben   24   C
3    255533333    BINENE      Felly   23   D
4    255566666  TSHIENSE      Chris   20   E

In [24]:
donnees_etudiants['matricule']

0      202205533
1      255222001
2    23122522511
3      255533333
4      255566666
Name: matricule, dtype: object

In [25]:
donnees_etudiants[['matricule','Nom']]

     matricule       Nom
0    202205533     NKULU
1    255222001    KABOLE
2  23122522511    MUKUNA
3    255533333    BINENE
4    255566666  TSHIENSE

In [26]:
donnees_etudiants.iloc[:,:]

     matricule       Nom     Prenom  Age GPA
0    202205533     NKULU  Dieumerci   22   A
1    255222001    KABOLE      David   21   B
2  23122522511    MUKUNA        Ben   24   C
3    255533333    BINENE      Felly   23   D
4    255566666  TSHIENSE      Chris   20   E

In [31]:
donnees_etudiants.iloc[ 2:3,:]

     matricule     Nom Prenom  Age GPA
2  23122522511  MUKUNA    Ben   24   C

In [28]:
#Afficher seulement la colonne age 
donnees_etudiants.iloc[ :,3:4 ]

   Age
0   22
1   21
2   24
3   23
4   20

In [32]:
donnees_etudiants.iloc[1:2,1:2]

      Nom
1  KABOLE